"use client";
import React from "react";

import { TracingBeam } from "../ui/tracing-beam";
import { Phetsarath } from "next/font/google";

const PhetsarathFont = Phetsarath({
  subsets: ["lao"],
  weight: "400",
});

export function TracingBeamDemo() {
  return (
    <TracingBeam className={`px-6 pt-20 font-bold ${PhetsarathFont.className}`}>
      <div className="max-w-2xl mx-auto antialiased pt-6 relative">
        {dummyContent.map((item, index) => (
          <div key={`content-${index}`} className="mb-10">
            <h2 className="bg-black text-white rounded-full text-sm w-fit px-4 py-1 mb-4">
              {item.badge}
            </h2>

            <div className="text-sm  prose prose-sm dark:prose-invert">
              {item?.image && (
                <img
                  src={item.image}
                  alt="blog thumbnail"
                  height="1000"
                  width="1000"
                  className="rounded-lg mb-10 object-cover"
                />
              )}
              {item.description}
            </div>
          </div>
        ))}
      </div>
    </TracingBeam>
  );
}

const dummyContent = [
  {
    title: "Lorem Ipsum Dolor Sit Amet",
    description: (
      <>
        <p>
          ກົດໝາຍອາຍາ ແມ່ນກົດໝາຍ​ທີ່ມີໜ້າ​ທີ່ປົກ​ປັກ​ຮັກສາລະບອບການເມືອງ, ເສດຖະກິດ ແລະ ສັງຄົມ ຂອງ ສປປ ລາວ, ກຳມະສິດ​ຂອງ​ລັດ, ລວມໝູ່ ​ແລະ ​ເອກະ​ຊົນ. ກົດໝາຍດັ່ງກ່າວ ມີຄວາມສໍາຄັນຫຼາຍຕໍ່ກັບ ການພັດທະນາໃນ ຂົງເຂດວຽກງານ ຍຸດຕິທໍາ ​ໂດຍ​ສະ​ເພາະ​ແມ່ນການແກ້ໄຂຂໍ້​ຂັດ​ແຍ້​ງທີ່​ແຕະຕ້ອງ​ເຖິງສິດ​ເສລີພາບ ແລະ ຜົນປະໂຫຍດ ອັນຊອບທໍາຂອງພົນລະເມືອງທຸກຄົນ, ຄວາມສະຫງົບຂອງ​ຊາດ ​ແລະ ຄວາມເປັນລະບຽບຮຽບຮ້ອຍ​ໃນສັງຄົມ..
        </p>
        <p>
          ມີຄວາມຮູ້ ແລະ ຄວາມສາມາດໃນການວິເຄາະການກະທຳຜິດ ແລະ ໂທດທາງອາຍາ, ມີທັກສະທີ່ຈຳເປັນໃນການດໍາເນີນຄະດີອາຍາເຊັ່ນ: ການເອົາຄໍາໃຫ້ການ (ໂຈດ ແລະ ຈໍາເລີຍ), ສ້າງບົດບັນທຶກ, ຂຽນຄໍາຖະແຫຼງສັ່ງຟ້ອງຜູ້ກະທໍາຜິດຂຶ້ນສານ ແລະ ແຕ່ງຄໍາຕັດສິນຂອງສານເປັນຕົ້ນ. ນອກຈາກນັ້ນ ຍັງໄດ້ຝຶກຝົນທັກສະໃນການສື່ສານ ແລະ ການວິເຄາະລາຍລະອຽດ.
        </p>
        <p>
          ຜ່ານການສຶກສາໃນຮົ້ວມະຫາໄລ,ສາມາດສະຫຼຸບໄດ້ດັ່ງນີ້: ໄດ້ຝຶກທັກສະໃນການເຂົ້າສັງຄົມ, ຮຽນຮູ້ການມືສ່ວນຮ່ວມໃນຂະບວນການທີ່ຈັດຂື້ນພາຍໃນ ແລະ ພາຍນອກ ຂອງມະຫາໄລນີ້.ເພື່ອເສີມທັກສະໃນການດຳລົງຊີວິດໃນອານາຄົດ ແລະ ເປັນບາດກ້າວທີ່ສຳຄັນ.
        </p>
      </>
    ),
    badge: "ຄະນະ ນິຕິສາດ ແລະ ລັດຖະສາດ ສິງຫາ 2018-ມິຖຸນາ 2022.",
    image:
      "/timeline1.jpg",
  },
  {
    title: "Lorem Ipsum Dolor Sit Amet",
    description: (
      <>
        <p>
          ໄດ້ເປີດບັ້ນ ອົບຮົມ-ຫັດແອບ ປະຈໍາປີ 2024, ຕາມແຜນການອົບຮົມ-ຫັດແອບ ຈະໄດ້ແບ່ງອອກເປັນ 3 ພາກຄື: ພາກການເມືອງ, ການທະຫານ ແລະ ພາກພະລາທິການ-ເຕັກນິກ 
          ຈຸດປະສົງເພື່ອເຮັດໃຫ້ນາຍ ແລະ ພົນທະຫານມີຄຸນທາດການ ເມືອງໜັກແໜ້ນ, ກໍາແໜ້ນບັນດາທິດສະດີ ຫຼັກການ ສິລະປະ ຍຸດ-ຍຸດທະວິທີ ມີຄວາມຊໍານານຄ່ອງແຄ້ວ, 
          ພ້ອມທັງ ເປັນການຊຸກຍູ້ຂະບວນການຈັດຕັ້ງປະຕິບັດຂໍ້ກໍານົດ, ກົດລະບຽບຂອງກອງທັບ ແລະ ເປັນການເຝິກຝົນກຳລັງກາຍຂອງພະນັກງານ-ນັກຮົບໃຫ້ມີສຸຂະພາບແຂງແຮງ 
          ເພື່ອກຽມພ້ອມເຮັດສໍາເລັດໜ້າທີ່ການເມືອງຂອງກົມກອງ.
        </p>
        <p>
          ຈຸດປະສົງເພື່ອເຮັດໃຫ້ນາຍ ແລະ ພົນທະຫານ ມີແນວຄິດການເມືອງໜັກແໜ້ນ, ມີຄວາມຮູ້ຄວາມສາມາດດ້ານການທະຫານ, ການເມືອງ, ພະລາທິການ ແລະ ເຕັກນິກໃນລະດັບທີ່ແນ່ນອນ, 
          ແນໃສ່ປັບປຸງລະບຽບແບບແຜນເຝິກຝົນກຳລັງແຮງກາຍຂອງພະນັກງານ-ນັກຮົບ ໃຫ້ມີສຸຂະພາບແຂງແຮງສາມາດເຄື່ອນໄຫວເຮັດສຳເລັດໜ້າທີ່ການເມືອງຂອງກົມກອງຕາມທີ່ໄດ້ຮັບມອບໝາຍ. 
          ໂອກາດດຽວກັນນີ້, ຍັງໄດ້ເປີດບັ້ນອົບຮົມ-ຫັດແອບທະຫານໃໝ່ ເຊິ່ງໃຊ້ເວລາໃນການອົບຮົມ 90 ວັນ. ພ້ອມທັງ, ເປີດຂະບວນການແຂ່ງຂັນພາຍ ໃຕ້ຄຳຂວັນຮັກຊາດ ແລະ ພັດ ທະນາ ປະຈໍາປີ 2024 ຕື່ມອີກ..
        </p>
      </>
    ),
    badge: "ກອງທັບປະຊາຊົນລາວ ກອງພັນ512 ທັນວາ.2024 - ມິຖຸນາ.2025",
    image:
      "/timeline2.jpg",
  },
  {
    title: "Lorem Ipsum Dolor Sit Amet",
    description: (
      <>
        <p>
          ຕະຫລອດໄລຍະການສຶກສາຮ່ຳຮຽນສາຍສາມັນມໍປາຍ ໄດ້ເຫັນວ່າ ຂອງກິນບໍ່ກິນມັນເໜົ່າ ຂອງເກົ່າບໍ່ເລົ່າມັນລືມ.
        </p>
      </>
    ),
    badge: "ມ.ສ ສະໜາມໄຊ ແຂວງ ອັດຕະປຶ ກັນຍາ.2011 - ມິຖຸນາ.2018",
    image:
      "/timeline3.jpg",
  },
  
];
