import { AnimatedTestimonials } from "@/components/ui/animated-testimonials";

export function AnimatedTestimonialsDemo() {
  const testimonials = [
    {
      quote:
        " ປະສົບການໃນການຝຶກງານ ທາງດ້ານໄອຍະການ 3 ເດືອນ. ຂຽນບົດສະຫຼຸບ,ຄຳຮ້ອງຝ້ອງ,ຕີລາຄາສຳນວນຄະດີ,ສົ່ງສຳນວນຄຳຮ້ອງຂື້ນສານຕັດສິນຄະດີ,ໄດ້ຂຽນສະໂນດນໍາສົ່ງ,ຂຽນຄໍາສັງຟ້ອງຜູ້ຖືກຫາຂື້ນສານ, ແລະ ອື່ນໆອີຫຫຼາຍຢ່າງ..",
      name: "ອົງການ ໄອຍະການປະຊາຊົນເຂດ III",
      designation: "ຝຶກອົບຮົມວິຊາການ ເດຶອນ ມັງກອນ 2022 - ເມສາ 2022",
      src: "/work1.jpg",
    },
    {
      quote:
        "ປະສົບການ ໃນການເປັນຜູ້ຊ່ວຍບໍລິຫານ ທາງດ້ານຝ່າຍອຸປະກອນ 3 ປີ ແຜ່ນການເຄື່ອນໄຫວວຽກງານລົງສະຖານທີ່,ລົງພັດທະນາຊຸ່ມຊົນຢູ່ແຂວງຄໍາມ່ວນ,ແຂວງວຽງຈັນແລະ ໃນການລົງຊອກເກັບກຳຂໍ້ມູນລົງສະຖານທີ່",
      name: "ກຸ່ມພັດທະນາຊຸ່ມຊົນ",
      designation: "ຜູ້ຊ່ວຍບໍລິຫານ ພຶດສະພາ.2018 - ມີນາ.2022",
      src: "/work2.jpg",
    },
    {
      quote:
        "ປະສົບການໃນການ ເຮັດວຽກ ເປັນຜູ້ຊວຍຮ້ານ Lotteria  1 ປີ ວຽກທີ່ເຮັດຕອບແຊັດລູກຄ້າ,ເຮັດລາຍງານປະອາທິດ,ລາຍງານໜ້າວຽກອາທິດຕໍ່ໄປ,ຂື້ນແຜນສັ່ງຊື້, ສະຫຼຸບ ສາມາຊິກສົ່ງໃຫ້​​ HR,ສ້າງ Excell ບັນທຶກຂໍ້ມູນການຂາຍ.....",
      name: "ບໍລິສັດ ໂຊກໄຊ ກຸ່ມ",
      designation: "ຜູ້ຊວຍຮ້ານ Lotteria",
      src: "/work3.jpg",
    },
    {
      quote:
        "ປະສົບການໃນການເຮັດວຽກຕີພີມກາ 3 ເດືອນ. ວຽກທີ່ເຮັດພະແນກ ພີມກາ.",
      name: "ບໍລິສັດ ສະກາວີ-ລາວ",
      designation: "ພະແນກອອກແບບພິມກາ",
      src: "/work4.png",
    },
    {
      quote:
        "ວຽກງານ; ຝຶກແອບຮ່ຳຮຽນ, ຍົກສູງລະດັບຄວາມຮູ້, ຄວາມສາມາດທາງດ້ານການເມືອງ, ການທະຫານ, ...",
      name: "ກະຊວງປ້ອງກັນປະເທດ",
      designation: "ທະຫານ",
      src: "/work6.png",
    },
  ];
  return <AnimatedTestimonials testimonials={testimonials} />;
}
